app/controllers/players_controller.rb

INSERT INTO "players" ("created_at", "email", "hashed_password", "irc_nick", "name", "notes", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "salt", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @player = Player.new(new_player_params)
    if @player.save

SELECT "players".* FROM "players" WHERE "players"."username" = 'tiwillia' LIMIT 1
---
  def edit
    @player = Player.find_by_username(params[:id])

SELECT "players".* FROM "players" WHERE "players"."username" = 'player' LIMIT 1
UPDATE "players" SET "notes" = 'Not really jim whitehurst lol. Just needed a test user. LOLOLOLOL', "updated_at" = '2013-12-04 04:13:55.132686' WHERE "players"."id" = 2
---
  def update
    @player = Player.find_by_username(params[:id])
    if @player.update_attributes(edit_player_params)

SELECT "players".* FROM "players"
---
  def index
    if admin?
      @players = Player.all

SELECT "players".* FROM "players" WHERE "players"."username" = 'timboj' LIMIT 1
---
  def show
    if session[:player]
      if @player = Player.find_by_username(params[:id])

SELECT "players".* FROM "players" WHERE "players"."username" = 'meverette' LIMIT 1
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 2]]
---
  def destroy
    @player = Player.find_by_username(params[:id])
    player = @player.name
    if @player.destroy

SELECT "players".* FROM "players" WHERE "players"."username" = 'jwhitehurst' LIMIT 1
---
  def change_password
    @player = Player.find_by_username(params[:id])